{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense_141/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "3136"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense_141/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3136"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/dense_141/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/decoder/dense_141/MatMul/ReadVariableOp", "StatefulPartitionedCall/decoder/dense_141/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/dense_141/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/reshape_28/Shape", "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack", "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack_1", "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/reshape_28/strided_slice", "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/1", "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/2", "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/decoder/dense_141/Relu", "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/reshape_28/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_84/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_84/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_84/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/reshape_28/Reshape"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_84/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_84/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_84/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_84/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_85/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_85/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_85/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose_84/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_85/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_85/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_85/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_85/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_86/Shape", "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack_1", "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack", "op": "Pack", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice", "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/1", "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/2", "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_86/stack", "StatefulPartitionedCall/decoder/conv2d_transpose_86/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/decoder/conv2d_transpose_85/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_86/conv2d_transpose", "StatefulPartitionedCall/decoder/conv2d_transpose_86/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_86/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_86/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/dense_141/MatMul/ReadVariableOp", "shape": [10, 3136], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/dense_141/BiasAdd/ReadVariableOp", "shape": [3136], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/reshape_28/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/reshape_28/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_84/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_85/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/decoder/conv2d_transpose_86/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}